; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v6 - type_1 ?v7 - type_2)
 	      (pred_1 ?v3 - object ?v7 - type_2)
	      (pred_3 ?v6 - type_1 ?v8 - type_3)
	      (pred_4 ?v6 - type_1 ?v3 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v6 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_2 ?v6 ?v5))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v5))))

   (:action op_1
       :parameters (?v6 - type_1 ?v4 - object ?v1 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v1) (pred_2 ?v6 ?v1) (pred_3 ?v6 ?v8))
       :effect (and (pred_4 ?v6 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v1)) 
		    (not (pred_3 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_1 ?v4 - object ?v1 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v4 ?v8) (pred_2 ?v6 ?v1))
       :effect (and (pred_1 ?v4 ?v1)
		    (pred_3 ?v6 ?v8)
		    (not (pred_4 ?v6 ?v4 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_1
obj_07 obj_06 - type_3
obj_02 obj_04 obj_05 - type_2
obj_03 obj_08 obj_01 - object)
(:init
(pred_2 obj_09 obj_02)
(pred_3 obj_09 obj_07)
(pred_3 obj_09 obj_06)
(pred_1 obj_03 obj_04)
(pred_1 obj_08 obj_05)
(pred_1 obj_01 obj_05)
)
(:goal
(and
(pred_1 obj_03 obj_02)
(pred_1 obj_08 obj_02)
(pred_1 obj_01 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_09 ?b obj_07))))
)
)

; plan
1. (op_2 obj_09 obj_02 obj_05)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_05)
   goals met: 1 of 3
2. (op_1 obj_09 obj_08 obj_05 obj_06)
   deleted: (pred_1 obj_08 obj_05) (pred_3 obj_09 obj_06)
   added: (pred_4 obj_09 obj_08 obj_06)
   goals met: 1 of 3
3. (op_2 obj_09 obj_05 obj_04)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_04)
   goals met: 1 of 3
4. (op_2 obj_09 obj_04 obj_02)
   deleted: (pred_2 obj_09 obj_04)
   added: (pred_2 obj_09 obj_02)
   goals met: 1 of 3
5. (op_3 obj_09 obj_08 obj_02 obj_06)
   deleted: (pred_4 obj_09 obj_08 obj_06)
   added: (pred_1 obj_08 obj_02) (pred_3 obj_09 obj_06)
   goals met: 2 of 3
6. (op_2 obj_09 obj_02 obj_04)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_04)
   goals met: 2 of 3
7. (op_1 obj_09 obj_03 obj_04 obj_06)
   deleted: (pred_1 obj_03 obj_04) (pred_3 obj_09 obj_06)
   added: (pred_4 obj_09 obj_03 obj_06)
   goals met: 2 of 3
8. (op_2 obj_09 obj_04 obj_02)
   deleted: (pred_2 obj_09 obj_04)
   added: (pred_2 obj_09 obj_02)
   goals met: 2 of 3
9. (op_3 obj_09 obj_03 obj_02 obj_06)
   deleted: (pred_4 obj_09 obj_03 obj_06)
   added: (pred_1 obj_03 obj_02) (pred_3 obj_09 obj_06)
   goals met: 3 of 3
